Autodesk.Revit.DB.BackgroundProcessTask.BackgroundProcessTaskType.op_Inequality(Autodesk.Revit.DB.BackgroundProcessTask.BackgroundProcessTaskType,Autodesk.Revit.DB.BackgroundProcessTask.BackgroundProcessTaskType)
Compares two BackgroundProcessTaskType instances.
first: The first BackgroundProcessTaskType.
second: The second BackgroundProcessTaskType.
Returns: True if the inputs are different, false if they are identical.

Autodesk.Revit.DB.BackgroundProcessTask.BackgroundProcessTaskType.op_Equality(Autodesk.Revit.DB.BackgroundProcessTask.BackgroundProcessTaskType,Autodesk.Revit.DB.BackgroundProcessTask.BackgroundProcessTaskType)
Compares two BackgroundProcessTaskType instances.
first: The first BackgroundProcessTaskType.
second: The second BackgroundProcessTaskType.
Returns: True if the inputs are identical, false if they are different.

Autodesk.Revit.DB.BackgroundProcessTask.BackgroundProcessTaskType.#ctor(System.Guid)
Creates a new BackgroundProcessTaskType instance.
guid: The identifier for the BackgroundProcessTaskType.

Autodesk.Revit.DB.BackgroundProcessTask.BackgroundProcessTaskType
BackgroundProcessTaskType
Since:
2027